#!/usr/bin/env python
# -*- coding: utf-8 -*-


FILE_EXT = ".csv"
INPUT_DIR = "data/"
OUTPUT_DIR = "output"

NUM_CAR_TYPE = 5
TIME_INTERVAL = 5  # minutes

PATHS = [
    ("圓山", "高雄(九如路)", "南"),
    ("圓山", "台中", "南"),
    ("台中", "高雄(九如路)", "南"),
    ("圓山", "林口(文化一路)", "南"),
    ("圓山", "新竹系統", "南"),
    ("高雄(九如路)", "圓山", "北"),
    ("台中", "圓山", "北"),
    ("高雄(九如路)", "台中", "北"),
    ("林口(文化北路)", "圓山", "北"),  # TODO
    ("新竹系統", "圓山", "北"),
    ("南港", "九如", "南"),
    ("南港", "沙鹿", "南"),
    ("沙鹿", "九如", "南"),
    ("南港", "鶯歌系統", "南"),
    ("九如", "南港", "北"),
    ("沙鹿", "南港", "北"),
    ("九如", "沙鹿", "北"),
    ("鶯歌系統", "南港", "北"),
    #("南港系統", "蘇澳", "南"),
    #("蘇澳", "南港系統", "北"),
]
