#!/usr/bin/env python
# -*- coding: utf-8 -*-

PATHS = [
    ("圓山", "高雄", "南"),
    ("圓山", "台中", "南"),
    ("台中", "高雄", "南"),
    ("圓山", "林口", "南"),
    ("圓山", "新竹", "南"),
    ("高雄", "圓山", "北"),
    ("台中", "圓山", "北"),
    ("高雄", "台中", "北"),
    ("林口", "圓山", "北"),
    ("新竹", "圓山", "北"),
    ("南港", "九如", "南"),
    ("南港", "沙鹿", "南"),
    ("沙鹿", "九如", "南"),
    ("南港", "鶯歌", "向"),
    ("屏東", "南港", "北"),
    ("台中", "南港", "北"),
    ("屏東", "沙鹿", "北"),
    ("鶯歌", "南港", "北"),
    ("南港", "蘇澳", "南"),
    ("蘇澳", "南港", "北"),
]
